Repository: shirimizrachi/beresheet
Catalog: lib/l10n/app_*.arb
Languages: he

# appTitle
source: Beresheet
he: בראשית

# appName
source: Beresheet
he: בראשית

# communitySubtitle
source: Residential Community
he: קהילת מגורים

source: Profile
he: פרופיל

source: My Registered Events
he: האירועים שלי

source: Manage Events
he: ניהול אירועים

source: Log Out
he: התנתק

source: Back
he: חזור

source: Home
he: בית

source: Login
he: התחבר

# loginTitle
source: Login
he: התחברות

# enterMobileNumberForOTP
source: Enter your Mobile Number
he: הזן את מספר הטלפון הנייד שלך

source: Mobile Number
he: מספר נייד

source: Send OTP
he: שלח קוד

# pleaseEnterValidPhoneNumber
source: Please enter a valid phone number
he: אנא הזן מספר טלפון תקין

# termsAndConditionsAcceptance
source: By Clicking, I accept the Terms & Conditions and Privacy Policy
he: בלחיצה, אני מקבל את התנאים וההגבלות ומדיניות הפרטיות

# otpTitle
source: OTP
he: קוד אימות

# verifyWithOTPSentTo
source: OTP Sent to {phoneNumber}
he: קוד אימות נשלח ל-{phoneNumber}

source: Enter OTP
he: הזן קוד אימות

# continueButton
source: Continue
he: המשך

source: Logout
he: התנתק

source: Register
he: הירשם

source: Email
he: דוא"ל

source: Password
he: סיסמה

source: Forgot Password?
he: שכחת סיסמה?

source: Create Account
he: צור חשבון

# alreadyHaveAccount
source: Already have an account?
he: כבר יש לך חשבון?

# dontHaveAccount
source: Don't have an account?
he: אין לך חשבון?

source: Full Name
he: שם מלא

source: Phone
he: טלפון

source: Apartment Number
he: מספר דירה

source: Edit Profile
he: ערוך פרופיל

source: Personal Information
he: מידע אישי

source: Contact Information
he: פרטי התקשרות

source: Birthday
he: תאריך לידה

source: Age
he: גיל

source: Role
he: תפקיד

source: Marital Status
he: מצב משפחתי

source: Gender
he: מין

source: Religious
he: דתיות

source: Native Language
he: שפת אם

source: Profile Photo
he: תמונת פרופיל

source: Tap to select from gallery
he: לחץ לבחירה מהגלריה

source: Press here to take photo
he: לחץ כאן כדי לצלם תמונה

source: Select Birthday
he: בחר תאריך לידה

# pleaseSelectBirthday
source: Please select your birthday
he: אנא בחר תאריך לידה

source: Create Profile
he: צור פרופיל

source: Update Profile
he: עדכן פרופיל

source: Profile created successfully!
he: הפרופיל נוצר בהצלחה!

source: Profile updated successfully!
he: הפרופיל עודכן בהצלחה!

source: Error saving profile
he: שגיאה בשמירת הפרופיל

# pleaseEnterFullName
source: Please enter your full name
he: אנא הזן שם מלא

# pleaseEnterPhoneNumber
source: Please enter your phone number
he: אנא הזן מספר טלפון

# pleaseEnterApartmentNumber
source: Please enter your apartment number
he: אנא הזן מספר דירה

source: Address
he: כתובת

# pleaseEnterAddress
source: Please enter your address
he: אנא הזן את הכתובת שלך

source: Events
he: אירועים

source: Event
he: אירוע

source: Event Details
he: פרטי האירוע

source: Upcoming Events
he: אירועים קרובים

source: Registered Events
he: אירועים רשומים

source: My Events
he: האירועים שלי

source: No events found
he: לא נמצאו אירועים

# registerEvent
source: Register
he: הירשם

source: Unregister
he: בטל רישום

source: Registered
he: רשום

source: Event Full
he: האירוע מלא

source: Available Spots
he: מקומות פנויים

source: Participants
he: משתתפים

source: Location
he: מיקום

source: Date & Time
he: תאריך ושעה

source: Description
he: תיאור

source: Event Name
he: שם האירוע

source: Event Type
he: סוג האירוע

source: Create Event
he: צור אירוע

source: Edit Event
he: ערוך אירוע

source: Delete Event
he: מחק אירוע

source: Max Participants
he: מספר משתתפים מקסימלי

source: Current Participants
he: משתתפים נוכחיים

source: Image URL
he: כתובת תמונה

# eventCreated
source: Event created successfully
he: האירוע נוצר בהצלחה

# eventUpdated
source: Event updated successfully
he: האירוע עודכן בהצלחה

# eventDeleted
source: Event deleted successfully
he: האירוע נמחק בהצלחה

source: Registration successful
he: ההרשמה הצליחה

source: Unregistration successful
he: ביטול ההרשמה הצליח

source: View Details
he: הצג פרטים

source: Retry
he: נסה שוב

# eventTypeEvent
source: Event
he: אירוע

# eventTypeSport
source: Sports
he: ספורט

# eventTypeCultural
source: Culture
he: תרבות

# eventTypeArt
source: Art
he: אומנות

# eventTypeEnglish
source: English
he: אנגלית

# eventTypeReligion
source: Religion
he: דת

source: Yes
he: כן

source: No
he: לא

source: OK
he: אישור

source: Cancel
he: בטל

source: Save
he: שמור

source: Edit
he: ערוך

source: Delete
he: מחק

source: Add
he: הוסף

source: Loading...
he: טוען...

source: Error
he: שגיאה

source: Success
he: הצלחה

source: Warning
he: אזהרה

source: Refresh
he: רענן

source: Try Again
he: נסה שוב

source: Required
he: נדרש

source: Optional
he: אופציונלי

source: Welcome
he: ברוך הבא

source: Something went wrong
he: משהו השתבש

source: Please wait
he: אנא המתן

source: Operation successful
he: הפעולה הצליחה

source: Operation failed
he: הפעולה נכשלה

source: Are you sure?
he: האם אתה בטוח?

source: Confirm Delete
he: אשר מחיקה

# fieldRequired
source: This field is required
he: שדה זה נדרש

source: Profile Information
he: מידע אישי

source: Favorite Activities
he: פעילויות מועדפות

# roleResident
source: Resident
he: תושב

# roleStaff
source: Staff
he: צוות

# roleInstructor
source: Instructor
he: מדריך

# roleService
source: Service Provider
he: ספק שירותים

# roleCaregiver
source: Caregiver
he: מטפל

# maritalStatusSingle
source: Single
he: רווק

# maritalStatusMarried
source: Married
he: נשוי

# maritalStatusDivorced
source: Divorced
he: גרוש

# maritalStatusWidowed
source: Widowed
he: אלמן

# genderMale
source: Male
he: זכר

# genderFemale
source: Female
he: נקבה

# religiousSecular
source: Secular
he: חילוני

# religiousOrthodox
source: Orthodox
he: דתי

# religiousTraditional
source: Traditional
he: מסורתי

# languageHebrew
source: Hebrew
he: עברית

# languageEnglish
source: English
he: אנגלית

# languageArabic
source: Arabic
he: ערבית

# languageRussian
source: Russian
he: רוסית

# languageFrench
source: French
he: צרפתית

# languageSpanish
source: Spanish
he: ספרדית

source: No orders found
he: לא נמצאו הזמנות

source: No products found
he: לא נמצאו מוצרים

source: Add to Cart
he: הוסף לעגלה

source: Back to Orders
he: חזור להזמנות

source: No user logged in
he: אין משתמש מחובר

source: Error loading order details
he: שגיאה בטעינת פרטי ההזמנה

source: No order found
he: לא נמצאה הזמנה

# unregisterConfirmation
source: Are you sure you want to unregister from
he: האם אתה בטוח שברצונך לבטל את הרישום מ

source: No registered events
he: אין אירועים רשומים

# registerFromHome
source: Register for events from the home page
he: הירשם לאירועים מהעמוד הראשי

# createFirstEvent
source: Tap the + button to create your first event
he: לחץ על כפתור + כדי ליצור את האירוע הראשון שלך

source: Failed to load events
he: נכשל בטעינת אירועים

source: Failed to delete event
he: נכשל במחיקת האירוע

source: Failed to unregister
he: נכשל בביטול הרישום

source: Enter event name
he: הזן שם אירוע

source: Please enter event name
he: אנא הזן שם אירוע

source: Enter event description
he: הזן תיאור אירוע

source: Please enter event description
he: אנא הזן תיאור אירוע

source: Enter event location
he: הזן מיקום אירוע

source: Please enter event location
he: אנא הזן מיקום אירוע

source: Enter maximum participants
he: הזן מספר משתתפים מקסימלי

source: Please enter maximum participants
he: אנא הזן מספר משתתפים מקסימלי

# pleaseEnterValidPositiveNumber
source: Please enter a valid positive number
he: אנא הזן מספר חיובי תקין

source: Enter current participants
he: הזן מספר משתתפים נוכחי

source: Please enter current participants
he: אנא הזן מספר משתתפים נוכחי

# pleaseEnterValidNonNegativeNumber
source: Please enter a valid non-negative number
he: אנא הזן מספר לא שלילי תקין

# currentParticipantsCannotExceed
source: Current participants cannot exceed maximum
he: המשתתפים הנוכחיים לא יכולים לעלות על המקסימום

source: Enter image URL
he: הזן כתובת תמונה

source: Please enter image URL
he: אנא הזן כתובת תמונה

source: Image Preview
he: תצוגה מקדימה של תמונה

source: Invalid image URL
he: כתובת תמונה לא תקינה

# createEventButton
source: CREATE EVENT
he: צור אירוע

# updateEventButton
source: UPDATE EVENT
he: עדכן אירוע

# deleteEventConfirmation
source: Are you sure you want to delete this event? This action cannot be undone.
he: האם אתה בטוח שברצונך למחוק את האירוע הזה? פעולה זו לא ניתנת לביטול.

source: Management Panel
he: פאנל ניהול

# welcomeToBeresheet
source: Welcome to Beresheet Community
he: ברוכים הבאים לקהילת בראשית

# discoverEvents
source: Discover amazing events and activities in our community
he: גלו אירועים ופעילויות מדהימים בקהילה שלנו

source: Featured Events
he: אירועים מובחרים

source: No events available
he: אין אירועים זמינים

source: Beresheet Community
he: קהילת בראשית

# buildingStrongerCommunity
source: Building a stronger community together
he: בונים קהילה חזקה יותר יחד

source: Refresh Events
he: רענן אירועים

source: Gallery View
he: תצוגת גלריה

# managementPanelTitle
source: Management Panel - Beresheet Community
he: פאנל ניהול - קהילת בראשית

# manageAllAspects
source: Manage all aspects of the Beresheet community
he: נהל את כל ההיבטים של קהילת בראשית

source: Management Tools
he: כלי ניהול

source: Events Management
he: ניהול אירועים

# createEditManageEvents
source: Create, edit, and manage community events
he: צור, ערוך ונהל אירועי קהילה

source: Users Management
he: ניהול משתמשים

# manageMembersPermissions
source: Manage community members and permissions
he: נהל חברי קהילה והרשאות

source: Announcements
he: הודעות

# createManageAnnouncements
source: Create and manage community announcements
he: צור ונהל הודעות קהילה

source: Facilities
he: מתקנים

# manageFacilitiesBookings
source: Manage community facilities and bookings
he: נהל מתקני קהילה והזמנות

source: Reports & Analytics
he: דוחות וניתוחים

# viewStatisticsReports
source: View community statistics and reports
he: צפה בסטטיסטיקות ודוחות קהילה

source: System Settings
he: הגדרות מערכת

# configureSystemSettings
source: Configure system settings and preferences
he: הגדר הגדרות מערכת והעדפות

source: Soon
he: בקרוב

source: Coming Soon
he: בקרוב

# featureUnderDevelopment
source: is currently under development and will be available in a future update.
he: נמצא כעת בפיתוח ויהיה זמין בעדכון עתידי.

source: Create New User Profile
he: צור פרופיל משתמש חדש

# createNewUserProfileDescription
source: Enter the basic information to create a new user profile. Additional details can be updated later.
he: הזן את המידע הבסיסי כדי ליצור פרופיל משתמש חדש. פרטים נוספים ניתן לעדכן מאוחר יותר.

# homeId
source: Home
he: בית

# homeIdRequired
source: Home selection is required
he: בחירת בית נדרשת

# pleaseEnterValidNumber
source: Please enter a valid number
he: אנא הזן מספר תקין

# selectHome
source: Select a home
he: בחר בית

source: Phone Number
he: מספר טלפון

# phoneNumberRequired
source: Phone number is required
he: מספר טלפון נדרש

source: Enter phone number
he: הזן מספר טלפון

source: Create User Profile
he: צור פרופיל משתמש

source: Creating...
he: יוצר...

source: Access Denied
he: גישה נדחתה

# onlyManagersCanCreateUsers
source: Only managers can create new user profiles.
he: רק מנהלים יכולים ליצור פרופילי משתמש חדשים.

source: User profile created successfully!
he: פרופיל המשתמש נוצר בהצלחה!

source: User ID
he: מזהה משתמש

# failedToCreateUserProfile
source: Failed to create user profile. Please try again.
he: נכשל ביצירת פרופיל משתמש. אנא נסה שוב.

source: An error occurred
he: התרחשה שגיאה

# webManagementPanel
source: Management Panel
he: פאנל ניהול

# webHomepage
source: Homepage
he: עמוד הבית

# webCreateEvent
source: Create Event
he: צור אירוע

# webEventsList
source: Events List
he: רשימת אירועים

# webEventRegistrations
source: Event Registrations
he: רישומים לאירועים

# webCreateUser
source: Create User
he: צור משתמש

# webUserList
source: User List
he: רשימת משתמשים

# webRooms
source: Rooms
he: חדרים

# webEventsManagement
source: Events Management
he: ניהול אירועים

# webFilter
source: Filter
he: מסנן

# webAll
source: All
he: הכל

# webApproved
source: Approved
he: מאושר

# webPendingApproval
source: Pending Approval
he: ממתין לאישור

# webDate
source: Date
he: תאריך

# webType
source: Type
he: סוג

# webStatus
source: Status
he: סטטוס

# webUpdateEvent
source: Update Event
he: עדכן אירוע

# webDeleteEvent
source: Delete Event
he: מחק אירוע

# webClearForm
source: Clear Form
he: נקה טופס

# webConfirmDelete
source: Confirm Delete
he: אשר מחיקה

# webFinalConfirmation
source: Final Confirmation
he: אישור סופי

# webDeleteConfirmMessage
source: Are you sure you want to delete the event "{eventName}"? This action cannot be undone.
he: האם אתה בטוח שברצונך למחוק את האירוע "{eventName}"? פעולה זו לא ניתנת לביטול.

# webFinalConfirmMessage
source: You approve removing the event from all users? This will permanently delete all registrations and cannot be undone.
he: האם אתה מאשר הסרת האירוע מכל המשתמשים? פעולה זו תמחק לצמיתות את כל הרישומים ולא ניתן לבטלה.

# webYesRemoveFromAllUsers
source: Yes, Remove from All Users
he: כן, הסר מכל המשתמשים

# webEventForm
source: Event Form
he: טופס אירוע

# webBasicInformation
source: Basic Information
he: מידע בסיסי

# webEventImage
source: Event Image
he: תמונת אירוע

# webImageSource
source: Image Source
he: מקור תמונה

# webDirectUrl
source: Direct URL
he: קישור ישיר

# webUnsplash
source: Photobank
he: בנק תמונות

# webUpload
source: Upload
he: העלאה

# webEnterImageUrl
source: Enter image URL
he: הזן כתובת תמונה

# webSearchUnsplash
source: Search on Photobank
he: חפש ב-בנק תמונות

source: Delete Photo
he: מחק תמונה

# areYouSureDeletePhoto
source: Are you sure you want to delete this photo?
he: האם אתה בטוח שברצונך למחוק את התמונה הזו?

source: Photo deleted successfully!
he: התמונה נמחקה בהצלחה!

# failedToDeletePhoto
source: Failed to delete photo: {statusCode}
he: נכשל במחיקת התמונה: {statusCode}

# errorDeletingPhoto
source: Error deleting photo: {error}
he: שגיאה במחיקת התמונה: {error}

# failedToLoadGalleryPhotos
source: Failed to load gallery photos: {statusCode}
he: נכשל בטעינת תמונות הגלריה: {statusCode}

# errorLoadingGalleryPhotos
source: Error loading gallery photos: {error}
he: שגיאה בטעינת תמונות הגלריה: {error}

source: No Photos Yet
he: אין תמונות עדיין

# uploadSomePhotos
source: Upload some photos to create a gallery for this event
he: העלה כמה תמונות כדי ליצור גלריה לאירוע הזה

source: Upload Images
he: העלה תמונות

# photoCount
source: {count} {count, plural, =1{Photo} other{Photos}}
he: {count} {count, plural, =1{תמונה} other{תמונות}}

source: Failed to load image
he: נכשל בטעינת התמונה

source: Failed to upload images
he: נכשל בהעלאת התמונות

# errorUploadingImages
source: Error uploading images: {error}
he: שגיאה בהעלאת התמונות: {error}

# webUploadImage
source: Upload Image
he: העלה תמונה

# webParticipantsSettings
source: Participants Settings
he: הגדרות משתתפים

# webRecurringSettings
source: Recurring Settings
he: הגדרות חזרה

# webRecurrence
source: Recurrence
he: חזרה

# webNoRecurrence
source: No Recurrence
he: ללא חזרה

# webDaily
source: Daily
he: יומי

# webWeekly
source: Weekly
he: שבועי

# webMonthly
source: Monthly
he: חודשי

# webYearly
source: Yearly
he: שנתי

# webCustomPattern
source: Custom Pattern
he: תבנית מותאמת

# webRecurringEndDate
source: Recurring End Date
he: תאריך סיום חזרה

# webSelectDate
source: Select Date
he: בחר תאריך

# webSelectTime
source: Select Time
he: בחר זמן

# webSelectRoom
source: Select a room
he: בחר חדר

# webNoRoomsAvailable
source: No rooms available
he: אין חדרים זמינים

# webFailedToLoadRooms
source: Failed to load rooms
he: נכשל בטעינת חדרים

# webEventCreationRequiresRole
source: Event creation requires manager, staff, or instructor role.
he: יצירת אירוע דורשת תפקיד של מנהל, צוות או מדריך.

# webAccessDenied
source: Access Denied
he: גישה נדחתה

# webReturnToHome
source: Return to Home
he: חזור לבית

# eventStatusPendingApproval
source: Pending Approval
he: ממתין לאישור

# eventStatusApproved
source: Approved
he: מאושר

# eventStatusRejected
source: Rejected
he: נדחה

# eventStatusCancelled
source: Cancelled
he: בוטל

# eventStatusDone
source: Done
he: הושלם

# userRoleManager
source: Manager
he: מנהל

# userRoleStaff
source: Staff
he: צוות

# userRoleInstructor
source: Instructor
he: מדריך

# userRoleResident
source: Resident
he: תושב

# userRoleCaregiver
source: Caregiver
he: מטפל

# userRoleService
source: Service
he: שירות

# eventRecurringNone
source: Once
he: פעם אחת

# eventRecurringDaily
source: Daily
he: יומי

# eventRecurringWeekly
source: Weekly
he: שבועי

# eventRecurringBiWeekly
source: Bi-Weekly
he: דו-שבועי

# eventRecurringMonthly
source: Monthly
he: חודשי

source: Location/Room
he: מיקום/חדר

source: Recurring Settings
he: הגדרות חזרה

source: Recurrence
he: חזרה

source: Event Image
he: תמונת אירוע

source: Upload
he: העלאה

source: Gallery (Phone only)
he: גלריה (טלפון בלבד)

source: Image Picker
he: בוחר תמונות

source: Clear Form
he: נקה טופס

# createForm
source: Create Event
he: צור אירוע

source: Validate Image URL
he: אמת כתובת תמונה

source: Update Event
he: עדכן אירוע

source: Event Time
he: זמן האירוע

source: Event Date
he: תאריך האירוע

source: End Date
he: תאריך סיום

source: Custom Pattern
he: תבנית מותאמת

source: Status
he: סטטוס

source: URL
he: כתובת URL

# unsplash
source: Photobank
he: בנק תמונות

source: Not set
he: לא נקבע

source: Service Provider Types
he: סוגי ספקי שירותים

# welcomeUser
source: Welcome, {userName}!
he: ברוך הבא, {userName}!

# roleLabel
source: Role: {roleName}
he: תפקיד: {roleName}

source: Available Features
he: תכונות זמינות

source: Create new events and activities
he: צור אירועים ופעילויות חדשים

source: View and manage event registrations
he: צפה ונהל רישומים לאירועים

source: Manage existing events
he: נהל אירועים קיימים

source: Event Registrations
he: רישומים לאירועים

source: Manage event registrations
he: נהל רישומים לאירועים

source: Create User
he: צור משתמש

source: Add new users to the system
he: הוסף משתמשים חדשים למערכת

source: User Management
he: ניהול משתמשים

source: View and edit existing users
he: צפה וערוך משתמשים קיימים

source: Rooms Management
he: ניהול חדרים

source: Manage event rooms and locations
he: נהל חדרי אירועים ומיקומים

# serviceProviderTypesManagement
source: Service Provider Types
he: סוגי ספקי שירותים

source: Manage service provider type categories
he: נהל קטגוריות של סוגי ספקי שירותים

source: Limited Access
he: גישה מוגבלת

# yourCurrentRoleHasLimitedAccess
source: Your current role ({roleName}) has limited access to management features.
he: התפקיד הנוכחי שלך ({roleName}) מוגבל בגישה לתכונות ניהול.

# accessDeniedTitle
source: Access Denied
he: גישה נדחתה

source: Return to Home
he: חזור לבית

source: Authentication failed
he: האימות נכשל

source: Return to Login
he: חזור להתחברות

source: Homepage
he: עמוד הבית

# managementPanelLabel
source: Management Panel
he: פאנל ניהול

# logoutTooltip
source: Logout
he: התנתק

# accessDeniedManagerRole
source: Access denied: Manager role required
he: גישה נדחתה: נדרש תפקיד מנהל

# eventRegistrationsManagementRequiresRole
source: Event registrations management requires manager or staff role.
he: ניהול רישומים לאירועים דורש תפקיד מנהל או צוות.

# eventsManagementRequiresRole
source: Events management requires manager or staff role.
he: ניהול אירועים דורש תפקיד מנהל או צוות.

# userCreationRequiresRole
source: User creation requires manager role.
he: יצירת משתמש דורשת תפקיד מנהל.

# userManagementRequiresRole
source: User management requires manager role.
he: ניהול משתמשים דורש תפקיד מנהל.

# roomsManagementRequiresRole
source: Rooms management requires manager role.
he: ניהול חדרים דורש תפקיד מנהל.

# serviceProviderTypesManagementRequiresRole
source: Service provider types management requires manager role.
he: ניהול סוגי ספקי שירותים דורש תפקיד מנהל.

# eventStatusUpdatedTo
source: Event status updated to {status}
he: סטטוס האירוע עודכן ל-{status}

source: Failed to update event status
he: נכשל בעדכון סטטוס האירוע

# errorUpdatingEvent
source: Error updating event: {error}
he: שגיאה בעדכון האירוע: {error}

# filterLabel
source: Filter:
he: מסנן:

source: All
he: הכל

source: Approved
he: מאושר

source: Pending Approval
he: ממתין לאישור

# errorTitle
source: Error
he: שגיאה

# retryButton
source: Retry
he: נסה שוב

source: No PENDING APPROVAL Events
he: אין אירועים הממתינים לאישור

source: No APPROVED Events
he: אין אירועים מאושרים

# eventsWillAppearHere
source: Events will appear here when they are created.
he: אירועים יופיעו כאן כשהם ייווצרו.

# editButton
source: Edit
he: ערוך

# eventDeletedSuccessfully
source: Event "{eventName}" deleted successfully
he: האירוע "{eventName}" נמחק בהצלחה

# pleaseEnterRoomName
source: Please enter a room name
he: אנא הזן שם חדר

source: Room created successfully
he: החדר נוצר בהצלחה

source: Failed to create room
he: נכשל ביצירת החדר

# errorCreatingRoom
source: Error creating room: {error}
he: שגיאה ביצירת החדר: {error}

# confirmDeleteRoom
source: Confirm Delete
he: אשר מחיקה

# areYouSureDeleteRoom
source: Are you sure you want to delete the room "{roomName}"?
he: האם אתה בטוח שברצונך למחוק את החדר "{roomName}"?

# roomDeletedSuccessfully
source: Room "{roomName}" deleted successfully
he: החדר "{roomName}" נמחק בהצלחה

source: Failed to delete room
he: נכשל במחיקת החדר

# errorDeletingRoom
source: Error deleting room: {error}
he: שגיאה במחיקת החדר: {error}

source: Create New Room
he: צור חדר חדש

source: Room Name
he: שם החדר

source: Enter room name
he: הזן שם חדר

source: Create Room
he: צור חדר

# creatingRoom
source: Creating...
he: יוצר...

source: Existing Rooms ({count})
he: חדרים קיימים ({count})

source: No Rooms Found
he: לא נמצאו חדרים

# createFirstRoom
source: Create your first room using the form above.
he: צור את החדר הראשון שלך באמצעות הטופס למעלה.

source: Unknown Room
he: חדר לא ידוע

# roomId
source: Room ID: {roomId}
he: מזהה חדר: {roomId}

source: Delete Room
he: מחק חדר

# failedToLoadRooms
source: Failed to load rooms: {statusCode}
he: נכשל בטעינת החדרים: {statusCode}

# errorLoadingRooms
source: Error loading rooms: {error}
he: שגיאה בטעינת החדרים: {error}

# usersManagementTitle
source: Users Management
he: ניהול משתמשים

# accessDeniedManagerRoleUserList
source: Access denied: Manager role required to view user list
he: גישה נדחתה: נדרש תפקיד מנהל לצפייה ברשימת המשתמשים

# failedToLoadUsers
source: Failed to load users: {statusCode}
he: נכשל בטעינת המשתמשים: {statusCode}

# errorLoadingUsers
source: Error loading users: {error}
he: שגיאה בטעינת המשתמשים: {error}

# totalUsers
source: Total Users: {count}
he: סך הכל משתמשים: {count}

source: No Users Found
he: לא נמצאו משתמשים

source: Search users...
he: חפש משתמשים...

source: Edit User
he: ערוך משתמש

# apartment
source: Apartment: {apartmentNumber}
he: דירה: {apartmentNumber}

# eventRegistrationsManagementTitle
source: Event Registrations Management
he: ניהול רישומים לאירועים

# refreshTooltip
source: Refresh
he: רענן

source: Unregister User
he: בטל רישום משתמש

# areYouSureUnregisterUser
source: Are you sure you want to unregister {userName} from this event?
he: האם אתה בטוח שברצונך לבטל את הרישום של {userName} מהאירוע הזה?

source: User unregistered successfully
he: רישום המשתמש בוטל בהצלחה

# errorMessage
source: Error: {error}
he: שגיאה: {error}

source: No registrations found
he: לא נמצאו רישומים

# totalRegistrations
source: Total Registrations: {count}
he: סך הכל רישומים: {count}

# eventColumn
source: Event
he: אירוע

# userNameColumn
source: User Name
he: שם משתמש

# phoneColumn
source: Phone
he: טלפון

# registrationDateColumn
source: Registration Date
he: תאריך רישום

# statusColumn
source: Status
he: סטטוס

# actionsColumn
source: Actions
he: פעולות

source: Unknown Event
he: אירוע לא ידוע

source: Unknown User
he: משתמש לא ידוע

# notAvailable
source: N/A
he: לא זמין
