Repository: shirimizrachi/beresheet
Catalog: lib/l10n/app_*.arb
Languages: he

# unregisterTooltip
source: Unregister
he: בטל רישום

# serviceProviderTypesManagementTitle
source: Service Provider Types Management
he: ניהול סוגי ספקי שירותים

source: Create New Service Provider Type
he: צור סוג ספק שירותים חדש

source: Edit Service Provider Type
he: ערוך סוג ספק שירותים

source: Service Provider Type Name
he: שם

source: Service Provider Type Description
he: תיאור

# nameCannotBeChanged
source: Name cannot be changed after creation
he: השם לא ניתן לשינוי

source: Create
he: צור

source: Update
he: עדכן

source: Clear
he: נקה

source: Existing Service Provider Types
he: סוגי ספקי שירותים קיימים

source: No service provider types found
he: לא נמצאו סוגי ספקי שירותים

source: No description
he: אין תיאור

# editTooltip
source: Edit
he: ערוך

# deleteTooltip
source: Delete
he: מחק

# pleaseEnterName
source: Please enter a name
he: אנא הזן שם

source: Service provider type created successfully
he: סוג ספק שירותים נוצר בהצלחה

source: Service provider type updated successfully
he: סוג ספק שירותים עודכן בהצלחה

source: Service provider type deleted successfully
he: סוג ספק שירותים נמחק בהצלחה

source: Failed to create service provider type
he: נכשל ביצירת סוג ספק שירותים

source: Failed to update service provider type
he: נכשל בעדכון סוג ספק שירותים

source: Failed to delete service provider type
he: נכשל במחיקת סוג ספק שירותים

source: Failed to load service provider types
he: נכשל בטעינת סוגי ספקי שירותים

source: Access denied: Manager role required
he: גישה נדחתה: נדרש תפקיד מנהל לעריכת משתמשים

source: Service provider types management requires manager role
he: ניהול סוגי ספקי שירותים דורש תפקיד מנהל.

# deleteServiceProviderTypeConfirmation
source: Are you sure you want to delete '{name}'?
he: האם אתה בטוח שברצונך למחוק את "{name}"? פעולה זו לא ניתנת לביטול.

source: Today
he: היום

source: Tomorrow
he: מחר

source: January
he: ינואר

source: February
he: פברואר

source: March
he: מרץ

source: April
he: אפריל

source: May
he: מאי

source: June
he: יוני

source: July
he: יולי

source: August
he: אוגוסט

source: September
he: ספטמבר

source: October
he: אוקטובר

source: November
he: נובמבר

source: December
he: דצמבר

source: Sunday
he: ראשון

source: Monday
he: שני

source: Tuesday
he: שלישי

source: Wednesday
he: רביעי

source: Thursday
he: חמישי

source: Friday
he: שישי

source: Saturday
he: שבת

source: Service Request
he: בקשת שירות

source: Card View
he: תצוגת כרטיסים

source: Event Instructors Management
he: ניהול מדריכי אירועים

source: Create New Instructor
he: יצירת מדריך חדש

source: Edit Instructor
he: עריכת מדריך

source: Instructor Name
he: שם המדריך

source: Enter instructor name
he: הזן שם המדריך

source: Please enter instructor name
he: אנא הזן שם המדריך

# instructorDescription
source: Description
he: תיאור

source: Enter description
he: הזן תיאור

source: Select Photo
he: בחר תמונה

source: Photo Selected
he: תמונה נבחרה

# selectedPhoto
source: Selected: {fileName}
he: נבחר: {fileName}

source: Create Instructor
he: צור מדריך

source: Update Instructor
he: עדכן מדריך

# creatingInstructor
source: Creating...
he: יוצר...

# updatingInstructor
source: Updating...
he: מעדכן...

source: Instructor created successfully
he: המדריך נוצר בהצלחה

source: Instructor updated successfully
he: המדריך עודכן בהצלחה

source: Failed to create instructor
he: נכשל ביצירת המדריך

source: Failed to update instructor
he: נכשל בעדכון המדריך

# errorCreatingInstructor
source: Error creating instructor: {error}
he: שגיאה ביצירת המדריך: {error}

# errorUpdatingInstructor
source: Error updating instructor: {error}
he: שגיאה בעדכון המדריך: {error}

# confirmDeleteInstructor
source: Confirm Delete
he: אישור מחיקה

# areYouSureDeleteInstructor
source: Are you sure you want to delete instructor "{instructorName}"?
he: האם אתה בטוח שברצונך למחוק את המדריך "{instructorName}"?

# instructorDeletedSuccessfully
source: Instructor "{instructorName}" deleted successfully
he: המדריך "{instructorName}" נמחק בהצלחה

source: Failed to delete instructor
he: נכשל במחיקת המדריך

# errorDeletingInstructor
source: Error deleting instructor: {error}
he: שגיאה במחיקת המדריך: {error}

source: Event Instructors ({count})
he: מדריכי אירועים ({count})

source: No Instructors Found
he: לא נמצאו מדריכים

# createFirstInstructor
source: Create your first instructor above
he: צור את המדריך הראשון שלך למעלה

source: Unknown Instructor
he: מדריך לא ידוע

# editInstructorTooltip
source: Edit Instructor
he: ערוך מדריך

# deleteInstructorTooltip
source: Delete Instructor
he: מחק מדריך

# failedToLoadInstructors
source: Failed to load instructors: {statusCode}
he: נכשל בטעינת המדריכים: {statusCode}

# errorLoadingInstructors
source: Error loading instructors: {error}
he: שגיאה בטעינת המדריכים: {error}

source: Event Instructors
he: מדריכי אירועים

# manageEventInstructors
source: Manage event instructors and their profiles
he: נהל מדריכי אירועים והפרופילים שלהם

# eventInstructorManagementRequiresRole
source: Event instructor management requires manager role
he: ניהול מדריכי אירועים דורש תפקיד מנהל

source: Event Date & Time
he: תאריך ושעת האירוע

source: Recurring Event Start Date
he: תאריך התחלת אירוע חוזר

source: Day of Month
he: יום בחודש

source: Day of Week
he: יום בשבוע

source: Recurring Schedule Configuration:
he: הגדרת לוח זמנים חוזר

source: Recurring Event Time
he: זמן האירוע החוזר

source: Select time for recurring events
he: בחר זמן לאירועים חוזרים

# pleaseSelectTimeForRecurringEvents
source: Please select a time for recurring events
he: אנא בחר זמן לאירועים חוזרים

# pleaseSelectDayOfWeekForWeeklyEvents
source: Please select a day of the week for weekly events
he: אנא בחר יום בשבוע לאירועים שבועיים

# pleaseSelectDayOfMonthForMonthlyEvents
source: Please select a day of the month for monthly events
he: אנא בחר יום בחודש לאירועים חודשיים

# endDateRequiredForRecurringEvents
source: End date is required for recurring events
he: תאריך סיום נדרש לאירועים חוזרים

# pleaseSelectDayOfWeek
source: Please select a day of the week
he: אנא בחר יום בשבוע

# pleaseSelectDayOfMonth
source: Please select a day of the month
he: אנא בחר יום בחודש

source: Event Instructor
he: מדריך האירוע

source: Event Instructor (Optional)
he: מדריך האירוע (אופציונלי)

source: No Instructor
he: ללא מדריך

# selectInstructor
source: Select an instructor
he: בחר מדריך

source: Instructor Exists
he: קיים מדריך

source: Gallery
he: גלריה

source: Event Gallery
he: גלריית האירוע

source: View Gallery
he: צפה בגלריה

source: Upload Images (Max 3)
he: העלה תמונות (מקסימום 3 ביחד)

source: Select Images
he: בחר תמונות

source: Images uploaded successfully!
he: התמונות הועלו בהצלחה!

# errorSelectingImages
source: Error selecting images: {error}
he: שגיאה בבחירת התמונות: {error}

# maximumImagesAllowed
source: Maximum 3 images allowed. Only the first 3 will be uploaded.
he: מותר מקסימום 3 תמונות. רק 3 הראשונות יועלו.

source: User session not found
he: הפעלת המשתמש לא נמצאה

# voteAndReview
source: Vote & Review
he: הצבעה וביקורת

source: Rate this event:
he: דרג את האירוע הזה:

# yourRating
source: Your rating: {rating} star{ratingPlural}
he: הדירוג שלך: {rating} כוכב{ratingPlural}

# writeReview
source: Write a review:
he: כתוב ביקורת:

# shareYourExperience
source: Share your experience with this event...
he: שתף את החוויה שלך מהאירוע הזה...

source: Submit Review
he: שלח ביקורת

source: Your reviews:
he: הביקורות שלך:

source: No reviews yet
he: אין ביקורות עדיין

source: Vote submitted successfully!
he: ההצבעה נשלחה בהצלחה!

source: Review submitted successfully!
he: הביקורת נשלחה בהצלחה!

# pleaseEnterReview
source: Please enter a review
he: אנא הזן ביקורת

source: Service Provider List
he: רשימת ספקי שירותים

source: Available Service Providers
he: ספקי שירותים זמינים

# chooseServiceProviderToSendRequest
source: Choose a service provider to send a request
he: בחר ספק שירותים לשליחת בקשה

source: No Service Providers Available
he: אין ספקי שירותים זמינים

# noServiceProvidersRegistered
source: No service providers are currently registered in your community.
he: כרגע אין ספקי שירותים רשומים בקהילה שלך.

source: Unknown Provider
he: ספק לא ידוע

source: Service Provider
he: ספק שירותים

source: Request
he: בקשה

source: History
he: היסטוריה

# errorLoadingServiceProviders
source: Error loading service providers: {error}
he: שגיאה בטעינת ספקי שירותים: {error}

# failedToLoadServiceProviders
source: Failed to load service providers: {statusCode}
he: נכשל בטעינת ספקי שירותים: {statusCode}

source: Request History
he: היסטוריית בקשות

source: No Request History
he: אין היסטוריית בקשות

# noServiceRequestsYet
source: You haven't made any service requests yet.
he: עדיין לא שלחת בקשות שירות.

source: Unknown date
he: תאריך לא ידוע

source: Yesterday
he: אתמול

# requestStatusOpen
source: Open
he: פתוח

# requestStatusInProgress
source: In Progress
he: בתהליך

# requestStatusClosed
source: Closed
he: סגור

# requestStatusAbandoned
source: Abandoned
he: ננטש

# requestsCount
source: {count} request{requestsPlural}
he: {count} {count, plural, =1{בקשה} other{בקשות}}

# errorLoadingRequestHistory
source: Error loading request history: {error}
he: שגיאה בטעינת היסטוריית בקשות: {error}

# failedToLoadRequestHistory
source: Failed to load request history: {statusCode}
he: נכשל בטעינת היסטוריית בקשות: {statusCode}

# sendMessageTo
source: Send a message to {serviceProviderName}
he: שלח הודעה ל-{serviceProviderName}

# typeMessage
source: Type a message...
he: הקלד הודעה...

source: Uploading media...
he: מעלה מדיה...

source: Camera
he: מצלמה

source: Video Gallery
he: גלריית וידאו

source: Record Video
he: הקלט וידאו

source: Audio Message
he: הודעה קולית

source: Microphone permission required
he: נדרשת הרשאה למיקרופון

# daysAgo
source: {days}d ago
he: לפני {days} ימים

# hoursAgo
source: {hours}h ago
he: לפני {hours} שעות

# minutesAgo
source: {minutes}m ago
he: לפני {minutes} דקות

source: Just now
he: כרגע

source: User not logged in
he: המשתמש לא מחובר

source: Message cannot be empty
he: ההודעה לא יכולה להיות ריקה

# errorSendingMessage
source: Error sending message: {error}
he: שגיאה בשליחת הודעה: {error}

# errorPickingImage
source: Error picking image: {error}
he: שגיאה בבחירת תמונה: {error}

# errorTakingPhoto
source: Error taking photo: {error}
he: שגיאה בצילום תמונה

# errorPickingVideo
source: Error picking video: {error}
he: שגיאה בבחירת וידאו: {error}

# errorRecordingVideo
source: Error recording video: {error}
he: שגיאה בהקלטת וידאו: {error}

# errorStartingRecording
source: Error starting recording: {error}
he: שגיאה בתחילת ההקלטה: {error}

# errorStoppingRecording
source: Error stopping recording: {error}
he: שגיאה בעצירת ההקלטה: {error}

# errorLoadingConversation
source: Error loading conversation: {error}
he: שגיאה בטעינת השיחה: {error}

# failedToLoadConversation
source: Failed to load conversation: {statusCode}
he: נכשל בטעינת השיחה: {statusCode}

# serviceProviderAutoResponse
source: {serviceProviderName} got your request and is committed to answer the request in maximum 30 minutes
he: {serviceProviderName} קיבל את הבקשה שלך ומתחייב לענות על הבקשה בתוך מקסימום 30 דקות
